{
  "tips": [
    {
      "category": "Economy",
      "text": "Place a Stonklodon early - the passive income compounds over time and funds your late-game legendary towers."
    },
    {
      "category": "Placement",
      "text": "Position towers at path bends where enemies spend the most time in range."
    },
    {
      "category": "Synergy",
      "text": "Brachiosaurus slowing aura makes every other tower more effective - it's a force multiplier."
    },
    {
      "category": "Defense",
      "text": "Keep an Ankylosaurus near your base as emergency defense - its area slam can save you from leaks."
    },
    {
      "category": "Strategy",
      "text": "Dilophosaurus acid pools persist between waves - use them to create permanent kill zones."
    },
    {
      "category": "Combat",
      "text": "Stegosaurus piercing spikes excel against clustered enemies - place them along straight path sections."
    },
    {
      "category": "Timing",
      "text": "Don't upgrade everything at once - stagger your purchases to maintain consistent defense."
    },
    {
      "category": "Priority",
      "text": "Focus fire on Officers and Overseers first - they buff nearby enemies making waves harder."
    },
    {
      "category": "Economy",
      "text": "Multiple Stonklodons stack - 3 early economy towers can fund an entire legendary arsenal."
    },
    {
      "category": "Combo",
      "text": "Triceratops knockback into Dilophosaurus acid pools creates a deadly combo."
    },
    {
      "category": "Boss",
      "text": "Steam Tanks appear every 7 waves - save burst damage or multiple slows for these minibosses."
    },
    {
      "category": "Advanced",
      "text": "Spinosaurus twin pools can cover multiple paths simultaneously on harder maps."
    },
    {
      "category": "Placement",
      "text": "Pteranodon's massive range lets it cover multiple paths from a central position."
    },
    {
      "category": "Defense",
      "text": "T-Rex fear roar affects enemies around the target, not the tower - aim for clustered groups."
    },
    {
      "category": "Speed",
      "text": "Fast enemies like Explorers require slows - layer Brachiosaurus and acid pools."
    },
    {
      "category": "Wave Management",
      "text": "Use Auto Next Wave checkbox to maintain momentum and earn completion bonuses faster."
    },
    {
      "category": "Map Strategy",
      "text": "On multi-path maps, place area damage towers where paths converge."
    },
    {
      "category": "Resource",
      "text": "Selling towers returns 70% of their cost - don't be afraid to reorganize your defense."
    },
    {
      "category": "Combat",
      "text": "Bleed damage from Raptor Nests stacks - multiple nests can melt tough enemies."
    },
    {
      "category": "Efficiency",
      "text": "One well-placed tower is worth three poorly positioned ones."
    },
    {
      "category": "Advanced",
      "text": "Chaplains heal enemies - prioritize them or waves will last much longer."
    },
    {
      "category": "Economy",
      "text": "Wave completion bonuses increase with difficulty - risk vs reward."
    },
    {
      "category": "Combo",
      "text": "Ankylosaurus slam into Stegosaurus spike line devastates grouped enemies."
    },
    {
      "category": "Map",
      "text": "Jungle Ridge is forgiving for learning - practice tower combinations here."
    },
    {
      "category": "Map",
      "text": "Volcanic Pass has three paths - you'll need area coverage, not just single-target damage."
    },
    {
      "category": "Defense",
      "text": "Lives are a resource - sometimes letting one enemy through to save money for a key tower is worth it."
    },
    {
      "category": "Visual",
      "text": "Watch for status effect rings on enemies - blue for slow, yellow for stun."
    },
    {
      "category": "Hotkey",
      "text": "Press R to rotate tower preview - useful for aesthetic placement."
    },
    {
      "category": "Speed",
      "text": "Use 2x speed once your defense is stable to progress faster."
    },
    {
      "category": "Strategy",
      "text": "Engineers reduce slow effectiveness - eliminate them quickly or your crowd control fails."
    }
  ]
}